import numpy as np
import pandas as pd

# Данные
data = np.array([
    8, 10, 11, 17, 15, 12, 15, 14, 16, 18,
    15, 18, 13, 14, 16, 17, 8, 11, 14, 10,
    16, 14, 18, 11, 11, 15, 15, 10, 12, 14,
    17, 12, 14, 14, 9, 12, 9, 13, 14, 10,
    12, 10, 11, 13, 11, 13, 14, 14, 12, 13,
    12, 14, 14, 12, 16, 15, 13, 13, 15, 12,
    13, 10, 12, 14, 15, 15, 19, 11, 14, 11,
    11, 11, 12, 14, 15, 13, 11, 17, 18, 13,
    12, 12, 12, 9, 10, 13, 9, 16, 14, 13,
    16, 13, 15, 12, 12, 17, 13, 15, 16, 14
])

# Вычисление уникальных значений и их частот
unique_values, counts = np.unique(data, return_counts=True)

# Создание DataFrame для отображения в формате таблицы
df = pd.DataFrame({
    'Диаметр головы (x_i)': unique_values,
    'Частота (n_i)': counts,
    'Относительная частота (w_i)': counts / len(data)
})

# Добавление кумулятивной частоты и относительной кумулятивной частоты
df['Накопленная частота (N_i)'] = df['Частота (n_i)'].cumsum()
df['Относительная накопленная частота (W_i)'] = df['Накопленная частота (N_i)'] / len(data)

# Сохранение таблицы
table_path = 'stat_table.xlsx'
df.to_excel(table_path, index=False)

df
