import re

# Вариант 3
t1 = '''Петров П.П. P3119
Анищенко А.А. P33113
Примеров Е.В. P3119
Иванов И.И. P3119
'''
# Анищенко А.А. P33113
# Иванов Е.В. P3119

t2 = '''Садов П.П. P3119
Столов А.А. P3320
Гошин Е.В. P3119
Антонов Сидоров И.И. P3119
'''
# Гошин Е.В. P3119 
# Столов А.А. P3319

t3 = '''Норманд Т.Р. P3119
Нинаев Л.С P3119
Громов К.Р P3119
'''
# Громов К.Р P3119

t4 = '''Ординов К.М P4040
Гамбург Т.Р P3119
Гощев Л.К P3119
Сарудинов Гелий П.С P3119
'''
# Ординов К.М P4040

t5 = '''Филатов А.Л P3119
Санаторий Ч.М P3119
'''
# Филатов А.Л P3119
# Санаторий Ч.М P3119

for t in [t1, t2, t3, t4, t5]:
    set_of_st = set(re.findall('.*\n', t))
    set_of_mates = [el for el in set_of_st if re.search('P3119', el)]
    for l in 'ЙЦУКЕНГШЩЗХФЫВАПРОЛДЖЭЯЧСМИТЬБЮ':
        mates = set(re.findall(f'.*{l}[^.].*\n', "".join(set_of_mates)))
        if len(mates) > 1:
            set_of_st -= mates
    for el in set_of_st:
        print(el, end="")
    print("\n")

